{
  "tutorial_title": "Example Gatsby Tutorial",
  "description": "A sample Gatsby tutorial!",
  "instructions": [
    {
      "type": "frame",
      "step": 1,
      "title": "Introduction",
      "hint": "This is a sample hint for the Introduction!",
      "content": [
        {
          "type": "text",
          "value": "Welcome to the tutorial. Here is an example of a code block."
        },
        {
          "type": "code",
          "value": "value = True\nif (value == True):\n print(\"Hello World!\")"
        },
        {
          "type": "text",
          "value": "You can mix text and code blocks to make up a single tutorial frame."
        }
      ],
      "answer": ["print(\"Hello World!\")"]
    },
    {
      "type": "frame",
      "step": 2,
      "title": "Step 2",
      "hint": "This is a sample hint for the second step!",
      "content": [
        {
          "type": "text",
          "value": "Instruction frames are used to separate each step."
        },
        {
          "type": "text",
          "value": "Text frames render as normal text. Code blocks are specially formatted"
        },
        {
          "type": "code",
          "value": "codeBlock = True\nwhile (codeBlock = True):\n  renderCodeBlock();"
        },
        {
          "type": "text",
          "value": "This is a better way to store code blocks in JSON."
        },
        {
          "type": "code",
          "value": "let t = True\nif (t)\n  console.log(\"Hi\")"
        }
      ],
      "answer": []
    },
    {
      "type": "frame",
      "step": 3,
      "title": "Step 3",
      "hint": "This is a sample hint for the third step!",
      "content": [
        {
          "type": "text",
          "value": "There's not much left to this tutorial. But we do have some todos."
        },
        {
          "type": "text",
          "value": "* Figure out a better way to store code blocks with newlines."
        },
        {
          "type": "text",
          "value": "* Implement scrolling for content that is too long."
        },
        {
          "type": "text",
          "value": "* Allow images to be used"
        },
        {
          "type": "text",
          "value": "* Syntax highlighting for code blocks?"
        }
      ],
      "answer": []
    },
    {
      "type": "frame",
      "step": 4,
      "title": "Step 4",
      "hint": "",
      "content": [
        {
          "type": "text",
          "value": "This is the last step. We're gonna test out the scrolling feature."
        },
        {
          "type": "text",
          "value": "Ghost flathead warbonnet, cowfish ghost knifefish oceanic flyingfish Jack Dempsey! Black prickleback glassfish bonytongue, moonfish, duckbill eel cusk-eel goby kappy Atlantic saury eagle ray arrowtooth eel loach goby ray. Pilot fish sucker, golden loach cornetfish x-ray tetra wolf-eel blacktip reef shark."
        },
        {
          "type": "code",
          "value": "codeBlock = True\nwhile (codeBlock = True):\n  renderCodeBlock();"
        },
        {
          "type": "text",
          "value": "Featherback \"slipmouth\" taimen tiger shark eulachon hillstream loach sixgill ray featherfin knifefish kissing gourami moray eel yellowtail kingfish. Dory yellowhead jawfish searobin zebra danio dusky grouper. Longnose lancetfish panga; jewfish blue shark, flat loach round stingray bigscale ghost pipefish tiger barb Bitterling Pacific salmon. Chubsucker nase, woody sculpin sailfish ling cod large-eye bream Atlantic trout deepwater cardinalfish yellowmargin triggerfish driftfish grunion, northern squawfish. Straptail stickleback Old World rivuline, \"mullet dab cornetfish,\" ghost pipefish. Flat loach kanyu pipefish northern sea robin merluccid hake, damselfish armoured catfish, mako shark herring smelt menhaden Razorback sucker bowfin straptail guppy zebra bullhead shark."
        }
      ],
      "answer": []
    }
  ]
}