{
  "tutorial_title": "Hello Data",
  "description": "A sample tutorial for testing purposes only.",
  "instructions": [
    {
      "type": "frame",
      "step": 1,
      "title": "Hello",
      "hint": "",
      "content": [
        {
          "type": "text",
          "value": "I'm baby echo park 90's palo santo iceland cloud bread yuccie, wolf helvetica organic portland hell of 8-bit thundercats bushwick."
        },
        {
          "type": "code",
          "value": "value = True\nif (value == True):\n print(\"Hello World!\")"
        },
        {
          "type": "text",
          "value": "Migas green juice wolf hoodie, mlkshk semiotics disrupt."
        }
      ]
    },
    {
      "type": "frame",
      "step": 2,
      "title": "I",
      "hint": "",
      "content": [
        {
          "type": "text",
          "value": "Affogato four dollar toast post-ironic kale chips."
        },
        {
          "type": "code",
          "value": "codeBlock = True\nwhile (codeBlock = True):\n  renderCodeBlock();"
        },
        {
          "type": "text",
          "value": " Affogato thundercats occupy, green juice iPhone poutine hoodie irony direct trade yr vaporware chillwave chartreuse ethical lo-fi."
        },
        {
          "type": "code",
          "value": "let t = True\nif (t)\n  console.log(\"Hi\")"
        }
      ]
    },
    {
      "type": "frame",
      "step": 3,
      "title": "am",
      "hint": "",
      "content": [
        {
          "type": "text",
          "value": "Hot chicken beard la croix, chillwave four dollar toast direct trade banh mi craft beer blue bottle slow-carb snackwave."
        },
        {
          "type": "text",
          "value": "Narwhal cloud bread VHS, deep v thundercats kombucha farm-to-table sartorial."
        }
      ]
    },
    {
      "type": "frame",
      "step": 4,
      "title": "evil",
      "hint": "",
      "content": [
        {
          "type": "text",
          "value": "This is the last step. We're gonna test out the scrolling feature."
        },
        {
          "type": "text",
          "value": "Vegan master cleanse echo park stumptown cornhole freegan heirloom listicle pork belly kogi yr bitters meditation etsy. Hot chicken beard la croix, chillwave four dollar toast direct trade banh mi craft beer blue bottle slow-carb snackwave. Dreamcatcher listicle cray enamel pin banjo street art cornhole microdosing. Neutra kale chips salvia, semiotics letterpress synth waistcoat meditation la croix. Photo booth letterpress ramps, etsy trust fund pork belly craft beer edison bulb vaporware selfies readymade. Truffaut iceland cray, synth direct trade drinking vinegar pitchfork fingerstache photo booth."
        },
        {
          "type": "code",
          "value": "codeBlock = True\nwhile (codeBlock = True):\n  renderCodeBlock();"
        },
        {
          "type": "text",
          "value": "Featherback \"slipmouth\" taimen tiger shark eulachon hillstream loach sixgill ray featherfin knifefish kissing gourami moray eel yellowtail kingfish. Dory yellowhead jawfish searobin zebra danio dusky grouper. Longnose lancetfish panga; jewfish blue shark, flat loach round stingray bigscale ghost pipefish tiger barb Bitterling Pacific salmon. Chubsucker nase, woody sculpin sailfish ling cod large-eye bream Atlantic trout deepwater cardinalfish yellowmargin triggerfish driftfish grunion, northern squawfish. Straptail stickleback Old World rivuline, \"mullet dab cornetfish,\" ghost pipefish. Flat loach kanyu pipefish northern sea robin merluccid hake, damselfish armoured catfish, mako shark herring smelt menhaden Razorback sucker bowfin straptail guppy zebra bullhead shark."
        }
      ]
    }
  ]
}
